# MySQL Queries

## . Import libraries

In [3]:
import pandas as pd

# MySQL libraries
import pymysql
from sqlalchemy import create_engine

import getpass
import matplotlib.pyplot as plt
import seaborn as sns

password = getpass.getpass()

········

## . Import data

In [ ]:
# import from MySQL credit_card_data database

In [4]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/Books'
engine = create_engine(connection_string)
query = ''' 
        
        Select *
        from Books
        ;
        '''
data = pd.read_sql_query(query, engine)
#data

NameError: name 'password' is not defined

## . Queries

1.

In [1]:
#query_1 = ''' 
        
        Select *
        from credit_card_data
        ;
        '''
#data_2 = pd.read_sql_query(query_2, engine)
#data_2

IndentationError: unexpected indent (Temp/ipykernel_15424/603406602.py, line 3)

4. Select all the data from table books to check if the data was imported correctly.

In [2]:
query_4 = '''
            select * from books;
            '''
data_4 = pd.read_sql_query(query_4, engine)
#data_4

NameError: name 'pd' is not defined

5.

In [3]:
query_5 = '''
            select * from books
            limit 10;
            '''
data_5 = pd.read_sql_query(query_5, engine)
#data_5

NameError: name 'pd' is not defined

6. Use sql query to find how many rows of data you have.

In [5]:
query_6 = '''
            select count(myunknowncolumn) from books;
            '''
data_6 = pd.read_sql_query(query_6, engine)
data_6

NameError: name 'pd' is not defined

 7. Now we will try to find the unique values in some of the categorical columns:
What are the unique values in the column `Offer_accepted`?

In [6]:
query_7_1 = '''
    select distinct(offer_accepted) from books;
    '''
data_7 = pd.read_sql_query(query_7_1, engine)
#data_7

NameError: name 'pd' is not defined

In [7]:
#What are the unique values in the column `Reward`?
query_7_2 = '''
        select distinct(reward) from books;
        '''
data_7_2 = pd.read_sql_query(query_7_2, engine)
#data_7_2

NameError: name 'pd' is not defined

In [22]:
# What are the unique values in the column `mailer_type`?
query_7_3 = '''
        select distinct(mailer_type) from credit_card_data;
    '''
data_7_3 = pd.read_sql_query(query_7_3, engine)
data_7_3

  mailer_type
0      Letter
1    Postcard

In [23]:
# What are the unique values in the column `credit_cards_held`?
query_7_4 = '''
        select distinct(credit_cards_held) from credit_card_data;
        '''
data_7_4 = pd.read_sql_query(query_7_4, engine)
data_7_4

   credit_cards_held
0                  2
1                  1
2                  3
3                  4

In [24]:
# What are the unique values in the column `household_size`?
query_7_5 = '''
        select distinct(household_size) from credit_card_data;
            '''
data_7_5 = pd.read_sql_query(query_7_5, engine)
data_7_5

   household_size
0               4
1               5
2               2
3               6
4               3
5               1
6               8
7               9

8. Arrange the data in a decreasing order by the average_balance of the house. 
Return only the customer_number of the top 10 customers with the highest average_balances in your data.

In [25]:
query_8 = '''
        select customer_number from credit_card_data
        order by average_balance desc
        limit 10;
        '''
data_8 = pd.read_sql_query(query_8, engine)
data_8

   customer_number
0             2297
1            12636
2             8888
3            10577
4            14004
5            10476
6             2656
7            15260
8            15609
9             8778

9. What is the average balance of all the customers in your data?

In [26]:
query_9 = '''
    select avg(average_balance) from credit_card_data;
    
'''
data_9 = pd.read_sql_query(query_9, engine)
data_9

   avg(average_balance)
0            940.515562

10. In this exercise we will use group by to check the properties of some of the categorical variables in our data. Note wherever average_balance is asked in the questions below, please take the average of the column average_balance:
What is the average balance of the customers grouped by `Income Level`? 
The returned result should have only two columns, income level and `Average balance` of the customers. 
Use an alias to change the name of the second column.

In [27]:
query_10_1 = '''
            select  income_level, avg(average_balance) as income_average_balance
            from credit_card_data
            group by income_level;

            '''
data_10_1 = pd.read_sql_query(query_10_1, engine)
data_10_1

  income_level  income_average_balance
0         High              942.574021
1       Medium              940.892940
2          Low              937.664983

In [28]:
#What is the average balance of the customers grouped by `number_of_bank_accounts_open`? 
#The returned result should have only two columns, `number_of_bank_accounts_open` and `Average balance` of the customers. 
#Use an alias to change the name of the second column.
query_10_2 = '''
            select bank_accounts_open  , avg(average_balance) as bank_account_average_balance
            from credit_card_data
            group by bank_accounts_open;

            '''
data_10_2 = pd.read_sql_query(query_10_2, engine)
data_10_2

   bank_accounts_open  bank_account_average_balance
0                   1                    941.533604
1                   2                    936.469491
2                   3                    948.284746

In [29]:
# What is the average number of credit cards held by customers for each of the credit card ratings? 
# The returned result should have only two columns, rating and average number of credit cards held. 
# Use an alias to change the name of the second column.
query_10_3 = '''
                select credit_rating  , avg(credit_cards_held) as avg_credit_cards_held
                from credit_card_data
                group by credit_rating;
            '''
data_10_3 = pd.read_sql_query(query_10_3, engine)
data_10_3

  credit_rating  avg_credit_cards_held
0          High                 1.8953
1        Medium                 1.9111
2           Low                 1.9040

Is there any correlation between the columns `credit_cards_held` and `number_of_bank_accounts_open`? 
You can analyse this by grouping the data by one of the variables and then aggregating the results of the other column. 
Visually check if there is a positive correlation or negative correlation or no correlation between the variables.
You might also have to check the number of customers in each category (ie number of credit cards held) to assess if 
that category is well represented in the dataset to include it in your analysis. 
For eg. If the category is under-represented as compared to other categories, ignore that category in this analysis

11. Your managers are only interested in the customers with the following properties:
 - Credit rating medium or high
 - Credit cards held 2 or less
 - Owns their own home
 - Household size 3 or more
For the rest of the things, they are not too concerned. 
Write a simple query to find what are the options available for them? 
Can you filter the customers who accepted the offers here?

In [30]:
query_11 = '''
            select credit_rating, credit_cards_held, homes_owned, household_size ,offer_accepted
            from credit_card_data
            where credit_rating = 'medium' or credit_rating = 'high'
            and credit_cards_held <= 2
            and homes_owned = 'yes'
            and household_size >= 3 
            having offer_accepted = 'yes';

            '''
data_11 = pd.read_sql_query(query_11, engine)
data_11

,credit_rating,credit_cards_held,homes_owned,household_size,offer_accepted
0,Medium,1,1,2,Yes
1,Medium,2,2,3,Yes
2,Medium,1,1,5,Yes
3,Medium,3,1,2,Yes
4,Medium,1,1,4,Yes
...,...,...,...,...,...
264,Medium,3,1,4,Yes
265,Medium,1,1,2,Yes
266,Medium,2,1,1,Yes
267,Medium,1,1,4,Yes
268,Medium,1,1,3,Yes

12. Your managers want to find out the list of customers whose average balance is less than the average balance 
of all the customers in the database. Write a query to show them the list of such customers. 
You might need to use a subquery for this problem.

In [31]:
query_12 = '''
            select customer_number, average_balance 
            from credit_card_data
            where average_balance <
            (select avg(average_balance) from credit_card_data
             ) 
             ;
    
            '''
data_12 = pd.read_sql_query(query_12, engine)
data_12

      customer_number  average_balance
0                   2           147.25
1                   3           276.50
2                   7           283.75
3                   8           278.50
4                  22           811.75
...               ...              ...
6996            17989           911.00
6997            17991           335.75
6998            17994           925.50
6999            17996           167.50
7000            17997           850.50

[7001 rows x 2 columns]

13. Since this is something that the senior management is regularly interested in, 
create a view called Customers__Balance_View1 of the same query.

In [34]:
query_13 = '''
            create Customers__Balance_View1 as
            select customer_number, average_balance 
            from credit_card_data
            where average_balance <
            (select avg(average_balance) from credit_card_data
             ) 
             ;

            '''
data_13 = pd.read_sql_query(query_13, engine)
data_13

ProgrammingError: (pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'Customers__Balance_View1 as\n            select customer_number, average_balance ' at line 1")
[SQL:
            create Customers__Balance_View1 as
            select customer_number, average_balance
            from credit_card_data
            where average_balance <
            (select avg(average_balance) from credit_card_data
             )
             ;

            ]
(Background on this error at: http://sqlalche.me/e/14/f405)

14. What is the number of people who accepted the offer vs number of people who did not?

In [35]:
query_14 = '''
            select sum(offer_accepted='Yes') as offer_accepted, sum(offer_accepted='No') as offer_not_accepted
            from credit_card_data;

        '''
data_14 = pd.read_sql_query(query_14, engine)
data_14

   offer_accepted  offer_not_accepted
0          1021.0             16955.0

15. Your managers are more interested in customers with a credit rating of high or medium. 
What is the difference in average balances of the customers with high credit card rating 
and low credit card rating?

In [36]:
query_15_1 = '''
                select customer_number, credit_rating, average_balance
                from credit_card_data
                where credit_rating = 'high' or credit_rating = 'medium';

                '''
data_15 = pd.read_sql_query(query_15_1, engine)
data_15

       customer_number credit_rating  average_balance
0                    1          High          1160.75
1                    2        Medium           147.25
2                    3        Medium           276.50
3                    4          High          1219.00
4                    5        Medium          1211.00
...                ...           ...              ...
12023            17988        Medium           943.00
12024            17989        Medium           911.00
12025            17991          High           335.75
12026            17999        Medium          1022.25
12027            18000        Medium          1056.00

[12028 rows x 3 columns]

In [37]:
query_15_2 = '''
                select credit_rating, avg(average_balance)
                from credit_card_data
                where credit_rating != 'low'
                group by credit_rating;
                '''
data_15_2 = pd.read_sql_query(query_15_1, engine)
data_15_2

       customer_number credit_rating  average_balance
0                    1          High          1160.75
1                    2        Medium           147.25
2                    3        Medium           276.50
3                    4          High          1219.00
4                    5        Medium          1211.00
...                ...           ...              ...
12023            17988        Medium           943.00
12024            17989        Medium           911.00
12025            17991          High           335.75
12026            17999        Medium          1022.25
12027            18000        Medium          1056.00

[12028 rows x 3 columns]

16. In the database, which all types of communication (mailer_type) were used and with how many customers?

In [38]:
query_16 = '''
            select mailer_type ,count(customer_number)
            from credit_card_data
            group by mailer_type;

            '''
data_16 = pd.read_sql_query(query_16, engine)
data_16

  mailer_type  count(customer_number)
0      Letter                    8842
1    Postcard                    9134

17. Provide the details of the customer that is the 11th least Q1_balance in your database.

In [ ]:
query_17 = '''
            select customer_number, rank(q1_balance) as rank_Q1
            from credit_card_data
            where rank_Q1 = 11;

'''
data_17 = pd.read_sql_query(query_17, engine)
data_17